app/controllers/application_controller.rb

  def session_user
    puts "===entering session_user (App controller)"
      decoded_hash = decoded_token
      if !decoded_hash.empty?
        puts "-->decoded_hash not empty"
          user_id = decoded_hash[0]['user_id']
          @user = User.find_by(id: user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]