app/controllers/star_systems_controller.rb

  def index
    render json: StarSystem.all, status: :ok
---
SELECT "star_systems".* FROM "star_systems"